{
  "name": "DLC 1.5 - Цитадель Альтерейн",
  "img": "modules/pf2e-ts-adv-aoa/145/Illustration/Citadel%20Altaerein2.webp",
  "caption": "",
  "description": "<section class=\"А\"><p>В АП Эпоха Пепла в конце первой книги Холм Адских Рыцарей группа получает во вледаение Цитадель Альтерейн и дальше со второй книги АП предлагает развивать цитадель за счет множества проверок, расхода золота и дней отдыха. Это во-первых крайне расточительно для группы, а во-вторых не имеет смысла, ибо цитадель по-настоящему участвует в сюжете всего один раз в шестой книги и являеться лишь декорацией боевой сцены. Из-за этих причин группа либо не участвует в развитие цитадели, либо потом сильно разочаровывается в ее развитие.</p><p>Для решения этой проблемы я и сделал это хомбрю (со скриптом) для развитие Цитадели Альтерейн без расходов со строны игроков и чтобы она давала бонус группе на протежение всех книг.</p></section>",
  "sort": 200000,
  "actors": [],
  "combats": [],
  "items": [],
  "journal": [
    {
      "folder": "01NFMW4i5Ly9i1Wp",
      "name": "Руководство по DLC 1.5",
      "_id": "vEyrbW9wje8R8Dn3",
      "pages": [
        {
          "sort": 100000,
          "name": "Введение",
          "type": "text",
          "_id": "JZ7iOjfJQkl4ivfW",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<p>В АП Эпоха Пепла в конце первой книги Холм Адских Рыцарей группа получает во вледаение Цитадель Альтерейн и дальше со второй книги АП предлагает развивать цитадель за счет множества проверок, расхода золота и дней отдыха. Это во-первых крайне расточительно для группы, а во-вторых не имеет смысла, ибо цитадель по-настоящему участвует в сюжете всего один раз в шестой книги и являеться лишь декорацией боевой сцены. Из-за этих причин группа либо не участвует в развитие цитадели, либо потом сильно разочаровывается в ее развитие.</p><p>Для решения этой проблемы я и сделал это хомбрю (со скриптом) для развитие Цитадели Альтерейн без расходов со строны игроков и чтобы она давала бонус группе на протежение всех книг.</p><ul><li><p>Торговец Сказками</p></li></ul>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752600764225,
            "modifiedTime": 1752608149076,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        },
        {
          "sort": 200000,
          "name": "Активация DLC",
          "type": "text",
          "_id": "GfDSyMTzo8fkICUY",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<p>Распаковка, как содержимого приключения DLC 1.5 - Цитадель Альтерейн, содержит только этот журнал с Руководстов по DLC 1.5. Сам же рабочий скрипт есть уже в модуле pf2e-ts-adv-aoa, который вы наверняка скачали что распаковать АП Эпоха Пепла от Торговца Сказками.</p><p>По умолчанию скрипт отключен и чтобы его активировать вам нужно перейти во вкладку Настройки Игры в правой части интерфейса Foundry, там выбрать Настройка параметров, и найти настройки для модуля TS-PF2E-ADV (Эпоха Пепла).</p><blockquote><p>Для этого модуль pf2e-ts-adv-aoa должен быть активаен, он же является модулем TS-PF2E-ADV (Эпоха Пепла), где одно его ID, а дургое публичное имя. Уточнение про необходимость активности в мире модуля pf2e-ts-adv-aoa не лишняя, ибо по умолчанию для распаковки приключения из АП Эпоха Пепла активация этого модуля не обязательно, ибо изначально модуль просто источник для изображений, но при активации вы сможете делать настройки приключения, такие как активации разных DLC.</p></blockquote><p>Если модуль активен, то в настройках для модуля TS-PF2E-ADV (Эпоха Пепла), вы увидете строки для активации различных DLC, на данный момент нас интресует только DLC 1.5. В будущих журналах будет подробно про другие DLC. Поставьте галочку напротив DLC 1.5, чтобы активировать скрипт, и уберите галочку, чтобы его деактивировать. Настройка применяется без перезагрузки.</p><p>При активном DLC 1.5 в правой части интерфейса во вкладке Актеры, на лице папке группы появится кнопка с иконкой из буквы \"A\". A - как Альтерейн, что название Цитадели, которую вы теперь можете развивать.</p><p>При деактивации DLC 1.5 кнопка исчезнет, но все изменения сохраняются, поэтому иногда вы можете отключать и включать DLC 1.5 по своим причинам не боясь потерять прогресс развития Цитадели Альтерейн.</p>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752601153121,
            "modifiedTime": 1752602288068,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        },
        {
          "sort": 300000,
          "name": "Игровой смысл DLC 1.5",
          "type": "text",
          "_id": "b74ZxhRAsQMTbo9Q",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<p>Прежде чем описывать окно развития Цитадели Альтерейн сперва я расскажу, что должно делать само хомбрю развития Цитадели Альтерейн.</p><p>При завершение первой книги, и каждой последующей, кроме шестой книги, группа будет получать 4 Очка Строительства, которые могут потратить на Расчитку, Оборону, Создание Комнаты и Улучшение Комнаты.</p><p>Чтобы приступить к Создание Комнат, что и будут давать бонусы группе, сперва нужно потратить хотя бы 1 Очко Строительства на Расчистку, так как подразумивается, что Цитадель Альтерейн со старта не пригодна для жизни и развития. Расчистка демонстрирует насколько вы делаете Цитадель Адьтерейн доступной к развитию и жизни. Расчистка показывают сколько вы можете Создать Комнат, но они не имеют прямой зависимости, так как при расходе первого Очка Строительства в Расчитску, вы получите сразу 2 свободные комнаты для Создание Комнаты. После первого расхода Очка Строительства в Расчистку, то есть начиная со второго Очка Строительства, вы будете получать по одной свободной комнате за каждое Очко Строительства, то есть 2 Очка Строительсва в Расчистку дают 3 свободные комнаты.</p><p>Потратив хоть 1 Очко Строительства в Расчистку вы получите место для свободных комнат, которые вы можете постоить. Создание Комнаты стоит 1 Очко Строительства. Вы сами выбираете как называется и выглядит ваша комната без каких-либо ограничений, но вы должны так же выбрать навык, которому эта комната дает бонус предмета. Как только комната построена ее бонус предмета к выбранному навыку +1, но вы можете Улучшать Комнату, чтобы развить бонус предмета до +4. Каждое улучшение - от +1 до +2, от +2 до +3, от +3 до +4 - стоит 1 Очко Строительства.</p><p>Как только построена хотя бы одна комната, все члену группы в начале каждой книги получают по 3 Очка Альтерейн, которые сохраняются до конца текущей книги. Эти Очки Альтерейн, имеют признак @Trait[Fortune]{Удача}, и работают схоже с Очками Героизма, позволяя перебросить бросок d20, с той разницей, что можно перебросить только бросок того навыка, комната которого построенна в Цитадели Альтерейн, а так же дополнительно к этому перебросу применяется бонус предмета равный бонусу предмета этой комнаты. Как обычно, при бонусе предмета, если у вас несколько бонусов предмета, то применяется наибольший.</p><p>Очки Обороны помогут в шестой книги Цитаделе Альтерейн пережить Возмездие Дахаки. Но только Первая Волна с Событиями 1-3 происходит в Цитадели Альтерейн, а все остальные Волны и События Возмездие Дахаки будут уже за границами Цитадели, поэтому предупредите игроков, что по сюжету на цитадель будет нападение, но при этом иметь больше 4 Очков Обороны может быть расточительно. Игроки вообще могут отказаться от Очков Обороны, но тогда в шестой книги они могут потерять несколько Очков Победы при Возмездие Дахаки. Но если они смогут быстро реагировать в Событиях 1-3 Первой Волны, то возможно справятся и без потерь Очков Победы, даже если нечего не потратят на Очки Обороны.</p><blockquote><p>Весь смысл оригинального развития цитадели был в том насколько крепкие стены сделают игроки. Про все остальные улучшения цитадели АП забывает. При этом как в оригинале, так и в моем хомбрю, сыгранная группа может справиться и без укрепление стен. И на кону всего 3 Очка Победы из 20, что можно в идеале получить во время Возмездия Дахаки.</p></blockquote>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752602437745,
            "modifiedTime": 1752605577919,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        },
        {
          "sort": 400000,
          "name": "Очки Строительства",
          "type": "text",
          "_id": "B4ALCqTRBdbAlCCC",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<blockquote><p>Внимание!!! Чтобы Игроки могли тратить Очки Строительства нужно чтобы игроки имели права владельца на лист группы.</p></blockquote><p>Чтобы открыть окно развитие Цитадели Альтерейн нажмите на кнопку с иконкой \"A\" на лице папки группы. Откроется окно Цитадели Альтерейн, на вкладке Обзор, которая пока пустая и нам не нужна. Переключитесь на вкладку Строительство.</p><p>В левой части Строительства, что видна только Мастеру, Мастер будет отмечать книги что вы завершили. Каждая отметка будет давать Игрокам 4 Очка Строительства.</p><blockquote><p>Мастер может сбросить всё, на случай если вы просто практивовались с окном развития, нажав кнопка Сбросить все очки.</p></blockquote><p>Игроки могут тратить Очки Строительства на Расчитску, Оборону, Создание Комнат и Улучшение Комнат (игровой смысл выше). Чтобы открыть Создание Комнат сперва потратьте хотя бы 1 Очко Строительства на Расчитску, сперва это даст 2 свободные комнаты, но потом по 1 свободной комнате за каждое Очко Строительства после первого.</p><p>Когда есть свободные комнаты Игроки могут нажать Построить Новую Комнату, и появится Новая Комнат - у нее название по умолчанию и не выбран навык. Игроки могут поменять название, выбрать иконку и выбрать навык. Когда навык будет выбран в Обзоре появятся кнопки для броска с бонусом предмета комнаты.</p><p>Игроки могут Улучшать Комнату, а значит и бонус предмета комнаты нажав + правее текущего бонуса, максимум +4.</p>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752605694955,
            "modifiedTime": 1752606759422,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        },
        {
          "sort": 500000,
          "name": "Обзор",
          "type": "text",
          "_id": "B8lFasL0S7lSWZ2F",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<blockquote><p>Внимание!!! Чтобы Игроки могли совершать броски в Обзоре, нужно чтобы игроки имели права владельца на лист группы.</p></blockquote><p>Когда Игроки построили комнаты и выбрали им навык, в Обзоре рядом с каждым персонажеим игрока появятся кнопки для броска каждой комнаты и ее навыка. Если Игроки дали комнате имя, то кнопка будет иметь имя этой комнаты, но снизу кнопки будет подписан навык и бонус предмета комнаты.</p><p>По задумки хомбрю, Игроки получают 3 Очка Альтерейн, для переброса (игровой смысл выше), в начале каждой новой книги и сохраняют их (и не пополняют) до конца текущей книги. Счетчик имеющихся Очко Альтерейн отображаются как красные \"A\" на черном фоне, справа от каждого персонажа игрока. Совершив бросок через кнопку в Обзоре, идет автоматический расход Очков Альтерейн.</p><p>Можно вручную добавить и отнять Очки Альтерейн через ПКМ (добавить) и ЛКМ (отнять).</p>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752606297691,
            "modifiedTime": 1752606677038,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        },
        {
          "sort": 600000,
          "name": "Обратная Связь",
          "type": "text",
          "_id": "FmOjCLRZdvwW0f9I",
          "system": {},
          "title": {
            "show": true,
            "level": 1
          },
          "image": {},
          "text": {
            "format": 1,
            "content": "<p>Вы можете писать о багах, благодарности и пожелания по следующим адресам:</p><p>Diskord - https://discord.com/invite/jYvjzn5</p><p>Boosty - https://boosty.to/tale_sale</p>"
          },
          "video": {
            "controls": true,
            "volume": 0.5
          },
          "src": null,
          "category": null,
          "flags": {},
          "_stats": {
            "compendiumSource": null,
            "duplicateSource": null,
            "exportSource": null,
            "coreVersion": "13.346",
            "systemId": "pf2e",
            "systemVersion": "7.2.3",
            "createdTime": 1752606799852,
            "modifiedTime": 1752607193798,
            "lastModifiedBy": "ANEMHORZaEmCTQJQ"
          },
          "ownership": {
            "default": -1
          }
        }
      ],
      "categories": [],
      "sort": 0,
      "flags": {
        "core": {
          "sheetClass": "AoA.AoAJournalSheet"
        }
      },
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.346",
        "systemId": "pf2e",
        "systemVersion": "7.2.3",
        "createdTime": 1752600755889,
        "modifiedTime": 1752601288481,
        "lastModifiedBy": "ANEMHORZaEmCTQJQ"
      },
      "ownership": {
        "default": 0
      }
    }
  ],
  "scenes": [],
  "tables": [],
  "macros": [],
  "cards": [],
  "playlists": [],
  "folders": [
    {
      "type": "JournalEntry",
      "folder": "pu199YuOyeeV5WqF",
      "name": "DLC 1.5 - Цитадель Альтерейн",
      "color": null,
      "sorting": "a",
      "_id": "01NFMW4i5Ly9i1Wp",
      "description": "",
      "sort": 0,
      "flags": {},
      "_stats": {
        "compendiumSource": "Folder.01NFMW4i5Ly9i1Wp",
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.345",
        "systemId": "pf2e",
        "systemVersion": "7.2.0",
        "createdTime": 1750606243863,
        "modifiedTime": 1750606260254,
        "lastModifiedBy": "ANEMHORZaEmCTQJQ"
      }
    },
    {
      "type": "JournalEntry",
      "folder": null,
      "name": "АП Эпоха Пепла",
      "color": null,
      "sorting": "a",
      "_id": "pu199YuOyeeV5WqF",
      "description": "",
      "sort": 0,
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.344",
        "systemId": "pf2e",
        "systemVersion": "7.1.1",
        "createdTime": 1749662117413,
        "modifiedTime": 1749662117413,
        "lastModifiedBy": "ANEMHORZaEmCTQJQ"
      }
    }
  ],
  "_id": "ROlMGKpt8O7y13k9",
  "folder": "6TreZ62vMxStt2rO",
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "exportSource": null,
    "coreVersion": "13.346",
    "systemId": "pf2e",
    "systemVersion": "7.2.3",
    "createdTime": 1752608217628,
    "modifiedTime": 1752608220636,
    "lastModifiedBy": "ANEMHORZaEmCTQJQ"
  },
  "_key": "!adventures!ROlMGKpt8O7y13k9"
}
